tap "ddev/ddev"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "pulumi/tap"
tap "sst/tap"
tap "supabase/tap"
tap "tursodatabase/tap"
tap "withgraphite/tap"
brew "act"
brew "giflib"
brew "jpeg-turbo"
brew "libpng"
brew "zstd"
brew "arp-scan"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "btop"
brew "caddy"
brew "cairo"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "diff-so-fancy"
brew "eye-d3"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "golangci-lint"
brew "gum"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "librsvg"
brew "micro"
brew "mkcert"
brew "ncspot"
brew "neovim"
brew "nmap"
brew "pkgconf"
brew "plow"
brew "pnpm"
brew "podman"
brew "presenterm"
brew "protobuf"
brew "python-setuptools"
brew "python@3.10"
brew "ripgrep"
brew "rust"
brew "sshpass"
brew "stow"
brew "streamrip"
brew "thefuck"
brew "tldr"
brew "tokei"
brew "trash", link: true
brew "tree"
brew "trufflehog"
brew "uv"
brew "wget"
brew "xh"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "sst/tap/sst"
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
brew "withgraphite/tap/graphite"
cask "1password-cli"
cask "deskpad"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
