tap "ddev/ddev"
tap "felixkratz/formulae"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "pulumi/tap"
tap "sst/tap"
tap "supabase/tap"
tap "tursodatabase/tap"
tap "vladkens/tap"
tap "withgraphite/tap"
brew "act"
brew "giflib"
brew "jpeg-turbo"
brew "libpng"
brew "zstd"
brew "arp-scan"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "biome"
brew "btop"
brew "caddy"
brew "cairo"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "diff-so-fancy"
brew "eye-d3"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "libusb"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gum"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "librsvg"
brew "md5sha1sum"
brew "micro"
brew "mkcert"
brew "ncspot"
brew "neovim"
brew "nmap"
brew "pkgconf"
brew "plow"
brew "pnpm"
brew "podman"
brew "postgresql@17"
brew "presenterm"
brew "protobuf"
brew "python-setuptools"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "rust"
brew "sshpass"
brew "starship"
brew "stow"
brew "streamrip"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash", link: true
brew "tree"
brew "trufflehog"
brew "typescript"
brew "uv"
brew "wget"
brew "xh"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
brew "sst/tap/sst"
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
brew "vladkens/tap/macmon"
brew "withgraphite/tap/graphite"
cask "1password-cli"
cask "claude-code"
cask "deskpad"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "granola"
cask "obsidian"
cask "redis-insight"
cask "superwhisper"
cask "zed"
cask "zen"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "nicoespeon.abracadabra"
vscode "prisma.prisma-insider"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "sleistner.vscode-fileutils"
vscode "sst-dev.opencode"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "wallabyjs.console-ninja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
